Revit 2024 API
ParameterTypeId.PointFlexibleConstrained Property
 "Constrained"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PointFlexibleConstrained { get; }
Visual Basic
Public Shared ReadOnly Property PointFlexibleConstrained As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PointFlexibleConstrained {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace